# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [153]:
import pandas as pd
import statistics as stats
import numpy as np
import math
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [154]:
employee = pd.read_csv('data/Employee.csv')
employee.head(20)

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [82]:
# Method 1
employee.groupby(['Department']).agg({'Salary': np.mean})

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

In [83]:
employee.pivot_table(index= ['Department'], values = ['Salary'], aggfunc = {'Salary':'mean'})

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [84]:
# Method 2
employee.pivot_table(index= ['Department', 'Title'], values = ['Salary'], aggfunc = {'Salary':'mean'}).reset_index()

  Department      Title  Salary
0         HR         VP    70.0
1         HR    analyst    32.5
2         IT         VP    70.0
3         IT    analyst    32.5
4         IT  associate    60.0
5      Sales  associate    55.0

In [85]:
employee.groupby(['Title','Department']).agg({'Salary': np.mean}).reset_index()

       Title Department  Salary
0         VP         HR    70.0
1         VP         IT    70.0
2    analyst         HR    32.5
3    analyst         IT    32.5
4  associate         IT    60.0
5  associate      Sales    55.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [34]:
employee.pivot_table(index= ['Title'], values = ['Salary', 'Years'])

              Salary  Years
Title
VP         70.000000   8.00
analyst    32.500000   2.25
associate  56.666667   4.00

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [186]:
employee.pivot_table(index=['Department','Title'], values = ['Salary', 'Name'], margins=True, margins_name='Count', aggfunc= {'Name':'count','Salary' :'mean', }).reset_index()

  Department      Title  Name     Salary
0         HR         VP     1  70.000000
1         HR    analyst     2  32.500000
2         IT         VP     1  70.000000
3         IT    analyst     2  32.500000
4         IT  associate     1  60.000000
5      Sales  associate     2  55.000000
6      Count                9  48.888889

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [171]:
employee.pivot_table(index= ['Department','Title',], values = ['Salary'], aggfunc = {'median','min','max','std'}).reset_index()
#This operation results in Nans for the standard deviation, 
#because there's only one associate in IT, one VP in IT and one VP in HR, 
#while the 2 associates in Sales earn the same salary (std =0).

  Department      Title Salary
                           max median   min       std
0         HR         VP   70.0   70.0  70.0       NaN
1         HR    analyst   35.0   32.5  30.0  3.535534
2         IT         VP   70.0   70.0  70.0       NaN
3         IT    analyst   35.0   32.5  30.0  3.535534
4         IT  associate   60.0   60.0  60.0       NaN
5      Sales  associate   55.0   55.0  55.0  0.000000

#### Based on your comments, fill the missing values with an appropriate value.

In [172]:
employee.pivot_table(index= ['Department','Title',], values = ['Salary'], aggfunc = {'median','min','max','std'}).reset_index().fillna(0)

  Department      Title Salary
                           max median   min       std
0         HR         VP   70.0   70.0  70.0  0.000000
1         HR    analyst   35.0   32.5  30.0  3.535534
2         IT         VP   70.0   70.0  70.0  0.000000
3         IT    analyst   35.0   32.5  30.0  3.535534
4         IT  associate   60.0   60.0  60.0  0.000000
5      Sales  associate   55.0   55.0  55.0  0.000000

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [176]:
employee.pivot_table(index=['Department'], values = ['Salary', 'Name'], margins=True, margins_name='Count', aggfunc= {'Salary' :'sum', 'Name':'count'})

            Name  Salary
Department
HR             3     135
IT             4     195
Sales          2     110
Count          9     440

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [180]:
employee.pivot_table(index=['Department'], values = ['Salary','Years'], columns=['Title'], margins=True, margins_name='Salary-mean/Years-Total', aggfunc={'Years':np.sum,'Salary':np.mean}).fillna('').round(2)

                        Salary                                             \
Title                       VP analyst  associate Salary-mean/Years-Total
Department
HR                        70.0    32.5                              45.00
IT                        70.0    32.5       60.0                   48.75
Sales                                        55.0                   55.00
Salary-mean/Years-Total   70.0    32.5  56.666667                   48.89

                        Years
Title                      VP analyst associate Salary-mean/Years-Total
Department
HR                        8.0     6.0                                14
IT                        8.0     3.0       7.0                      18
Sales                                       5.0                       5
Salary-mean/Years-Total  16.0     9.0      12.0                      37

In [206]:
employee.pivot_table(index= ['Department', 'Title'], values = ['Salary','Years'], aggfunc = {'Salary':'mean','Years':'sum'}).reset_index()

  Department      Title  Salary  Years
0         HR         VP    70.0      8
1         HR    analyst    32.5      6
2         IT         VP    70.0      8
3         IT    analyst    32.5      3
4         IT  associate    60.0      7
5      Sales  associate    55.0      5

In [187]:
#employee.pivot_table(index=['Department','Title'], values = ['Salary', 'Years'], margins=True, margins_name='Count', aggfunc= {'Salary' :'mean', 'Name':'count'})

KeyError: "Column(s) ['Name'] do not exist"

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [197]:
def without_max(employee):
     
    max_sal_dp = employee['Department','Salary'].max()
    department = employee['Department']
    
    for i in department:
        if x > max_sal_dp:
            return x
        else:
            return 0

employeewithoutmax = employee.apply(without_max)
employeewithoutmax.head()

KeyError: 'key of type tuple not found and not a MultiIndex'

In [199]:
employee.pivot_table(index= ['Department'], values = ['Salary'], aggfunc = {'Salary':'max'})

            Salary
Department
HR              70
IT              70
Sales           55

In [203]:
#employee2 = (employee.pivot_table(index= ['Department'], values = ['Salary'], aggfunc = {'Salary':'max'})).to_list()

AttributeError: 'DataFrame' object has no attribute 'to_list'